# 创建方法参数dataframe
import pandas as pd
from imkernel.model.new_model import find_children

method_parameter_df = pd.DataFrame(data=[
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Chord_Length(截面弦长)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Upper_Max_Width(叶背最大厚度)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Upper_Max_Width_Loc(叶背最大厚度位置)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Upper_Angle(叶背与尾缘夹角)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Upper_tip_coeff(叶背-前缘外形因数)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Upper_aft_part_shape(扩散点位置)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Lower_max_width(叶盆最大厚度)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Lower_max_width_loc(叶盆最大厚度位置)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Lower_Angle(叶盆与尾缘夹角)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Lower_tip_coeff(叶背-前缘外形因数)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Lower_aft_part_shape(扩散点位置)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "十一参数", "输入参数", "Tangent_Leading_Edge(前缘切向夹角)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "采样点", "输入参数", "SectionPoints(点位x,y,z)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "输出参数", "CurvePoints(点位x,y,z)"),
    ('方法参数', '叶片设计参数', '型线生成参数', "输出参数", "cpts(控制点坐标x,y,z)"),
    ('方法参数', '叶片设计参数', '曲面生成参数', "输入参数", "CurvePoints(弧线点x,y,z)"),
    ('方法参数', '叶片设计参数', '曲面生成参数', "输出参数", "未封闭曲面(.obj)"),
    ('方法参数', '叶片设计参数', '端面封闭参数', "输入参数", "未封闭曲面(.obj)"),
    ('方法参数', '叶片设计参数', '端面封闭参数', "输出参数", "封闭曲面(.obj)"),
    ('方法参数', '轨迹规划参数', '精加工算法参数', "输入参数", "cpts(控制点x,y,z)"),

])
